In [77]:
pip install pandas

Requirement already satisfied: pandas in c:\users\vani\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\vani\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.16.5 in c:\users\vani\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\vani\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: six>=1.5 in c:\users\vani\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [78]:
import pandas as pd
df={'cars' : ["BMW","VOLVO","FORD"],
      'passings' : [2,5,6]
     }
print(pd.DataFrame(df))

    cars  passings
0    BMW         2
1  VOLVO         5
2   FORD         6

In [79]:
print(pd.__version__)

1.2.4

In [80]:
var=pd.DataFrame(df)
print(var.loc[2])

cars        FORD
passings       6
Name: 2, dtype: object

In [81]:
print(var.loc[[0,2]])

   cars  passings
0   BMW         2
2  FORD         6

In [82]:
var=pd.DataFrame(df, index = ["a","b","c"])
print(var)

    cars  passings
a    BMW         2
b  VOLVO         5
c   FORD         6

In [83]:
import pandas as pd
df=pd.read_csv("C:/Users/VANI/Downloads/hp2.csv")
print(df)

   area     price
0  2600  550000.0
1  3000  565000.0
2  3200  610000.0
3  3600  680000.0
4  4000  725000.0
5  3600       NaN

In [84]:
print(df.to_string())

   area     price
0  2600  550000.0
1  3000  565000.0
2  3200  610000.0
3  3600  680000.0
4  4000  725000.0
5  3600       NaN

In [85]:
print(df.head(3))

   area     price
0  2600  550000.0
1  3000  565000.0
2  3200  610000.0

In [86]:
print(df.head())

   area     price
0  2600  550000.0
1  3000  565000.0
2  3200  610000.0
3  3600  680000.0
4  4000  725000.0

In [87]:
print(df.tail())

   area     price
1  3000  565000.0
2  3200  610000.0
3  3600  680000.0
4  4000  725000.0
5  3600       NaN

In [88]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   area    6 non-null      int64
 1   price   5 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 224.0 bytes
None

In [89]:
df.describe()

              area          price
count     6.000000       5.000000
mean   3333.333333  626000.000000
std     500.666223   74949.983322
min    2600.000000  550000.000000
25%    3050.000000  565000.000000
50%    3400.000000  610000.000000
75%    3600.000000  680000.000000
max    4000.000000  725000.000000

In [90]:
df.area

0    2600
1    3000
2    3200
3    3600
4    4000
5    3600
Name: area, dtype: int64

In [91]:
df.price

0    550000.0
1    565000.0
2    610000.0
3    680000.0
4    725000.0
5         NaN
Name: price, dtype: float64

In [92]:
df.iloc[:3,:2]

   area     price
0  2600  550000.0
1  3000  565000.0
2  3200  610000.0

In [93]:
df.price.mean()

626000.0

In [94]:
df.isnull()

    area  price
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
5  False   True

In [95]:
df.fillna(0)

   area     price
0  2600  550000.0
1  3000  565000.0
2  3200  610000.0
3  3600  680000.0
4  4000  725000.0
5  3600       0.0

In [96]:
df.dropna()

   area     price
0  2600  550000.0
1  3000  565000.0
2  3200  610000.0
3  3600  680000.0
4  4000  725000.0

In [97]:
df.insert(2,"deal","yes")

In [98]:
df

   area     price deal
0  2600  550000.0  yes
1  3000  565000.0  yes
2  3200  610000.0  yes
3  3600  680000.0  yes
4  4000  725000.0  yes
5  3600       NaN  yes

In [99]:
df.memory_usage(deep=True)

Index    128
area      48
price     48
deal     360
dtype: int64

In [100]:
df.price.value_counts()

680000.0    1
610000.0    1
725000.0    1
565000.0    1
550000.0    1
Name: price, dtype: int64

In [106]:
print(df.drop_duplicates(inplace=True))

None

In [109]:
df.groupby(by='area').price.mean()

area
2600    550000.0
3000    565000.0
3200    610000.0
3600    680000.0
4000    725000.0
Name: price, dtype: float64

In [121]:
import pandas as pd
data = {'Name':['tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]}
df = pd.DataFrame(data)

In [122]:
df

    Name  Age
0    tom   20
1   nick   21
2  krish   19
3   jack   18

In [136]:
df.sort_values(by='Name',inplace=True)

In [137]:
df.nunique(axis=1)

new name    2
2           2
1           2
0           2
dtype: int64

In [138]:
print(df.rename(index={3:"new name"},inplace=False))

           Name  Age
new name   jack   18
2         krish   19
1          nick   21
0           tom   20

In [139]:
df.Name=df.Age.rank()

In [140]:
df

          Name  Age
new name   1.0   18
2          2.0   19
1          4.0   21
0          3.0   20

In [146]:
import pandas as pd
data = {'Name':['tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18],'gender'
       :['male','male','female','male']}
df = pd.DataFrame(data)

In [147]:
df

    Name  Age  gender
0    tom   20    male
1   nick   21    male
2  krish   19  female
3   jack   18    male

In [148]:
df["gender"].isin(["male"])

0     True
1     True
2    False
3     True
Name: gender, dtype: bool